## 문제1

In [ ]:
결측값을 보간처리하여 임의의 값으로 처리해라.

In [70]:
import numpy as np

In [71]:
s = pd.Series([0, 3, np.nan, 12, 15])

In [72]:
s.interpolate()

0     0.0
1     3.0
2     7.5
3    12.0
4    15.0
dtype: float64

## 문제2

In [ ]:
결측값을 채우시오(1.앞행, 2.뒤행, 3,평균값)

In [76]:
import pandas as pd

In [77]:
df = pd.DataFrame({"v1":[None,200,None,400], "v2":[None,200,100,250], "v3":[40,60,500,700]})

In [78]:
df

      v1     v2   v3
0    NaN    NaN   40
1  200.0  200.0   60
2    NaN  100.0  500
3  400.0  250.0  700

In [79]:
df.fillna(0)

      v1     v2   v3
0    0.0    0.0   40
1  200.0  200.0   60
2    0.0  100.0  500
3  400.0  250.0  700

In [80]:
df.fillna(method='ffill')	# 앞 행의 값으로 결측치 채우기

      v1     v2   v3
0    NaN    NaN   40
1  200.0  200.0   60
2  200.0  100.0  500
3  400.0  250.0  700

In [81]:
df.fillna(method='bfill')	# 뒤 행의 값으로 결측치 채우기

      v1     v2   v3
0  200.0  200.0   40
1  200.0  200.0   60
2  400.0  100.0  500
3  400.0  250.0  700

In [82]:
df.fillna(df.mean())	# 각 열의 평균 값으로 결측치 채우기

      v1          v2   v3
0  300.0  183.333333   40
1  200.0  200.000000   60
2  300.0  100.000000  500
3  400.0  250.000000  700

## 문제 3

In [89]:
import pandas as pd

In [90]:
school_info = pd.read_csv('data/school_major.xls',encoding='cp949')

UnicodeDecodeError: 'cp949' codec can't decode byte 0xb1 in position 5: illegal multibyte sequence

In [91]:
school_info

NameError: name 'school_info' is not defined

In [1]:
import pandas as pd

In [3]:
flight_route_info = pd.read_csv('data/flight_route_info.csv',encoding='cp949')

In [4]:
flight_route_info.columns

Index(['노선명', '항공사', '출발지', '출발국', '도착지', '도착국', '검수', '2016.6', '2018.5',
       '상태', '비고', '운항 횟수', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_겨울 총합', '운항_2017.3', '운항_2017.4',
       '운항_2017.5', '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄',
       '운항_2018봄', '운항_봄 총합', '운항_2016.6', '운항_2016.7', '운항_2016.8',
       '운항_2017.6', '운항_2017.7', '운항_2017.8', '운항_2016여름', '운항_2017여름',
       '운항_여름 총합', '운항_2016.9', '운항_2016.10', '운항_2016.11', '운항_2017.9',
       '운항_2017.10', '운항_2017.11', '운항_2016가을', '운항_2017가을', '운항_가을 총합', '운송량',
       '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12', '운송량_2017.1',
       '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2', '운송량_2016겨울',
       '운송량_2017겨울', '운송량_겨울 총합', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_봄총합', '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6',
       '운송량_2017.7', '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_여름 총합',
       '운송량_2016.9', '운송량_2016.10', '운송량_2016.11', '운송량_2017.9', '운송량_2017.10',
       '운송량_2017.11', '운송량_2016가을', '운송량_2017가을', '운송량_가을 총합'],
      dtype='object')

In [6]:
flight_route_info.filter(like='2016.7')

     운항_2016.7  운송량_2016.7
0            5         985
1            5         937
2            5         745
3            0           0
4            4         788
..         ...         ...
672         13        2457
673         12        2268
674          0           0
675          0           0
676          0           0

[677 rows x 2 columns]

In [13]:
flight_regex = flight_route_info.filter(regex='\d')

In [14]:
flight_regex.columns

Index(['2016.6', '2018.5', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_2017.3', '운항_2017.4', '운항_2017.5',
       '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄', '운항_2018봄',
       '운항_2016.6', '운항_2016.7', '운항_2016.8', '운항_2017.6', '운항_2017.7',
       '운항_2017.8', '운항_2016여름', '운항_2017여름', '운항_2016.9', '운항_2016.10',
       '운항_2016.11', '운항_2017.9', '운항_2017.10', '운항_2017.11', '운항_2016가을',
       '운항_2017가을', '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12',
       '운송량_2017.1', '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2',
       '운송량_2016겨울', '운송량_2017겨울', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6', '운송량_2017.7',
       '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_2016.9', '운송량_2016.10',
       '운송량_2016.11', '운송량_2017.9', '운송량_2017.10', '운송량_2017.11', '운송량_2016가을',
       '운송량_2017가을'],
      dtype='object')

In [15]:
flight_route_info.filter(like='2018').head()

,2018.5,운항_2018,운항_2018.1,운항_2018.2,운항_2018.3,운항_2018.4,운항_2018.5,운항_2018봄,운송량_2018,운송량_2018.1,운송량_2018.2,운송량_2018.3,운송량_2018.4,운송량_2018.5,운송량_2018봄
0,O,22,4,5,5,5,3,13,3578,596,820,970,745,447,2162
1,O,23,5,4,4,6,4,14,4102,895,896,746,969,596,2311
2,O,16,4,2,4,4,2,10,2459,596,298,596,596,373,1565
3,O,9,1,2,2,3,1,6,1341,149,298,298,447,149,894
4,O,9,1,2,2,2,2,6,1416,149,298,373,298,298,969

In [17]:
op = pd.read_csv('data/series_dataframe.csv')

In [18]:
op.head

<bound method NDFrame.head of          Member      Series   DataFrame
0             T           T           T
1           abs         abs         abs
2           add         add         add
3    add_prefix  add_prefix  add_prefix
4    add_suffix  add_suffix  add_suffix
..          ...         ...         ...
259      values      values      values
260         var         var         var
261        view        view         NaN
262       where       where       where
263          xs          xs          xs

[264 rows x 3 columns]>

In [19]:
op.shape

(264, 3)

In [21]:
(op['Series']==op['DataFrame']).head

<bound method NDFrame.head of 0       True
1       True
2       True
3       True
4       True
       ...
259     True
260     True
261    False
262     True
263     True
Length: 264, dtype: bool>

In [23]:
op_eq=op.loc[(op['Series']==op['DataFrame'])]

In [24]:
op_eq.shape

(190, 3)

In [26]:
op_eq.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [27]:
op_eq.tail()

     Member  Series DataFrame
256  update  update    update
259  values  values    values
260     var     var       var
262   where   where     where
263      xs      xs        xs

In [28]:
op_eq_list=op_eq['Member'].tolist()

In [29]:
op_eq_list

['T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_copy',
 'isin',
 'isna',
 'isnull',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'sem',
 'set_axis',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

In [31]:
college = pd.read_csv('data/2017_college_tuition.csv',encoding='euc-kr')

In [32]:
college.shape

(196, 3)

In [33]:
flight_route_info = pd.read_csv('data/flight_route_info.csv',encoding='cp949')

In [34]:
flight_route_info.columns

Index(['노선명', '항공사', '출발지', '출발국', '도착지', '도착국', '검수', '2016.6', '2018.5',
       '상태', '비고', '운항 횟수', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_겨울 총합', '운항_2017.3', '운항_2017.4',
       '운항_2017.5', '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄',
       '운항_2018봄', '운항_봄 총합', '운항_2016.6', '운항_2016.7', '운항_2016.8',
       '운항_2017.6', '운항_2017.7', '운항_2017.8', '운항_2016여름', '운항_2017여름',
       '운항_여름 총합', '운항_2016.9', '운항_2016.10', '운항_2016.11', '운항_2017.9',
       '운항_2017.10', '운항_2017.11', '운항_2016가을', '운항_2017가을', '운항_가을 총합', '운송량',
       '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12', '운송량_2017.1',
       '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2', '운송량_2016겨울',
       '운송량_2017겨울', '운송량_겨울 총합', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_봄총합', '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6',
       '운송량_2017.7', '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_여름 총합',
       '운송량_2016.9', '운송량_2016.10', '운송량_2016.11', '운송량_2017.9', '운송량_2017.10',
       '운송량_2017.11', '운송량_2016가을', '운송량_2017가을', '운송량_가을 총합'],
      dtype='object')

In [35]:
flight_route_info.index

RangeIndex(start=0, stop=677, step=1)

In [36]:
# 열중에 특정값이 있는 열을 filter함수의 like 인자를 통해 필터링
flight_route_info.filter(like='2016.6').head()

  2016.6  운항_2016.6  운송량_2016.6
0      O          4         692
1      O          4         692
2      O          4         596
3      O          0           0
4      O          5         985

In [37]:
flight_regex = flight_route_info.filter(regex='\d')

In [38]:
flight_regex.columns

Index(['2016.6', '2018.5', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_2017.3', '운항_2017.4', '운항_2017.5',
       '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄', '운항_2018봄',
       '운항_2016.6', '운항_2016.7', '운항_2016.8', '운항_2017.6', '운항_2017.7',
       '운항_2017.8', '운항_2016여름', '운항_2017여름', '운항_2016.9', '운항_2016.10',
       '운항_2016.11', '운항_2017.9', '운항_2017.10', '운항_2017.11', '운항_2016가을',
       '운항_2017가을', '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12',
       '운송량_2017.1', '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2',
       '운송량_2016겨울', '운송량_2017겨울', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6', '운송량_2017.7',
       '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_2016.9', '운송량_2016.10',
       '운송량_2016.11', '운송량_2017.9', '운송량_2017.10', '운송량_2017.11', '운송량_2016가을',
       '운송량_2017가을'],
      dtype='object')

In [39]:
flight_route_info.filter(like='2018').head()

,2018.5,운항_2018,운항_2018.1,운항_2018.2,운항_2018.3,운항_2018.4,운항_2018.5,운항_2018봄,운송량_2018,운송량_2018.1,운송량_2018.2,운송량_2018.3,운송량_2018.4,운송량_2018.5,운송량_2018봄
0,O,22,4,5,5,5,3,13,3578,596,820,970,745,447,2162
1,O,23,5,4,4,6,4,14,4102,895,896,746,969,596,2311
2,O,16,4,2,4,4,2,10,2459,596,298,596,596,373,1565
3,O,9,1,2,2,3,1,6,1341,149,298,298,447,149,894
4,O,9,1,2,2,2,2,6,1416,149,298,373,298,298,969

In [41]:
import numpy as np

In [42]:
#nan => 결측값으로 처리한다는 것을 의미, None
s = pd.Series([0, 1, np.nan, 3])

In [43]:
s.fillna(method='ffill')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [44]:
s.fillna(method='pad')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [45]:
s.fillna(method='bfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [46]:
s.fillna(method='backfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [47]:
flight_route_info.isnull().sum().head(13)

노선명          0
항공사          0
출발지          0
출발국          0
도착지          0
도착국          0
검수           0
2016.6       0
2018.5       0
상태           0
비고         412
운항 횟수        0
운항_2016      0
dtype: int64

In [48]:
type(flight_route_info.isnull().sum())

pandas.core.series.Series

In [49]:
# 개별 열의 누락된 값의 총합을 구함
flight_route_info.isnull().sum().sum()

412

In [51]:
# 특정열의 유일 값별 개수
flight_route_info['비고'].value_counts()

2016.11.05. 이후 폐선             4
2018.04.24. 이후 기록 없음          3
2017.07 한 달                   2
2017.10.27. 이후 폐선             2
2018.04.26. 이후 기록 없음          2
                             ..
2017.11.24. 이후 폐선             1
2017.06.19. 이후 폐선             1
2017.10.26. 이후 폐선             1
2017.09.28. 이후 폐선             1
2016.09.19~2017.02.27 한시운영    1
Name: 비고, Length: 246, dtype: int64

In [52]:
# dropna=False 인자를 설정하게 되면 결측치에 대한 집계도 가능 
flight_route_info['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2016.10 한 달 운항            2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [53]:
flight_route_info['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2016.10 한 달 운항            2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [54]:
flight_route_info['비고'].dtype

dtype('O')

In [55]:
flight_route_info.head()

,노선명,항공사,출발지,출발국,도착지,도착국,검수,2016.6,2018.5,상태,...,운송량_여름 총합,운송량_2016.9,운송량_2016.10,운송량_2016.11,운송량_2017.9,운송량_2017.10,운송량_2017.11,운송량_2016가을,운송량_2017가을,운송량_가을 총합
0,7J105,Tajik Air,DYU,TJK,IKA,IRI,O,O,O,완료,...,4258,842,985,596,746,597,448,2423,1791,4214
1,7J117,Tajik Air,DYU,TJK,DEL,IND,O,O,O,완료,...,3440,794,815,990,224,0,0,2599,224,2823
2,7J4801,Tajik Air,DYU,TJK,SVX,RUS,O,O,O,완료,...,3949,970,896,596,745,448,448,2462,1641,4103
3,7J4805,Tajik Air,DYU,TJK,SGC,RUS,O,O,O,완료,...,0,0,0,298,0,0,0,298,0,298
4,7J4849,Tajik Air,DYU,TJK,FRU,KGZ,O,O,O,완료,...,3604,767,788,596,298,0,0,2151,298,2449

In [56]:
#결측치 데이터를 무시해도 될 경우, 임의의 다른 값으로 채운다.
flight_route_info.fillna(" ",inplace=True)

In [57]:
flight_route_info.isnull().sum().sum()

0

In [58]:
flight_route_info[['비고']]

                             비고
0
1
2
3
4
..                          ...
672            2017.10.27 이후 페선
673
674            2017.12.16 하루 운항
675            2017.03.25 이후 폐선
676  2016.09.19~2017.02.27 한시운영

[677 rows x 1 columns]

In [59]:
# nan412 -> 공백이 412건 변경
flight_route_info['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2016.10 한 달 운항            2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [60]:
flight_route_info_2 = pd.read_csv('data/flight_route_info.csv',encoding='cp949')

In [61]:
# 결측치가 412건
flight_route_info_2['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2016.10 한 달 운항            2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [62]:
# 결측치를 ''로 처리
# NaN, ' ', ''의 차이는? (아래 아래 예 참고)
flight_route_info_3 = flight_route_info_2.select_dtypes(['object']).fillna('')

In [63]:
flight_route_info_3['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2016.10 한 달 운항            2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [64]:
import numpy as np
data1 = 'magic key 1'
data2 = None   #미정의(앞으로할당 하겠다는 의미)
data3 = np.nan  #미정의(앞으로할당 하겠다는 의미)
data4 = ' '     # ' ' 주소를 가지고 있음
data5 = ''      #''주소를 가지고 있음
data1, data2, data3, data4, data5

('magic key 1', None, nan, ' ', '')